app/controllers/posts_controller.rb

UPDATE "posts" SET "views" = COALESCE("views", 0) + 1 WHERE "posts"."id" = 6
---
  def show
    @post.increment!(:views)

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "views") VALUES ('Filme ', 'As tranças da vovó careca', '2025-11-21 18:10:01.634759', '2025-11-21 18:10:01.634759', NULL) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
    def set_post
      @post = Post.find(params[:id])